Кратак опис: Корисник на табли врши уређивање UML дијаграма класа (додавање/брисање чворова/веза). Након што је завршио, корисник има могућност да генерише структуиран пројекат у програмском језику C++ притиском на дугме “Generate code” или да затвори пројекат.

* Актери:
    * Корисник – уређује UML дијаграм класа

* Предуслови: Табла (whiteboard) је успешно отворена.

* Постуслови: Направљени дијаграм је валидан.

* Основни ток:

1. Корисник интерактивно уређује дијаграм (Drag & Drop), при чему се приликом сваког покушаја повезивања врши провера исправности (валидација) дијаграма (да ли је повезивање смислено, да ли постоји дијамант и слично):
    
    1.1. Уколико је дијаграм исправан, прелази се на корак 2.
    
    1.2. Уколико дијаграм није исправан, апликација обавештава корисника путем прозора да је повезивање које је покушао неисправно. Након што корисник кликне "OK", прелази се на корак 1.
2. Корисник има две опције (описане у наредним подописима):
    
    2.1. Чување дијаграма:
        `export_project_use_case_description.md`
    
    2.2. Генерисање пројекта према направљеном дијаграму:
        `generate_project_use_case_description.md`
3. Отварање генерисаног пројекта:
    `modify_project_use_case_description.md`
4. Одабиром опције "Close Project" затвара се тренутни пројекат и апликација приказује главни мени.

* Алтернативни токови:

    А1: Неочекивани излаз из апликације. Уколико у било ком кораку корисник искључи апликацију, све евентуално запамћене информације о актуелном пројекту се поништавају и апликација завршава рад. Случај употребе се завршава.

* Подтокови: /
* Специјални захтеви: /